tap "elastic/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "mongodb/brew"
tap "sambadevi/powerlevel9k"
tap "homebrew-ffmpeg/ffmpeg"
# Shell extension to jump to frequently used directories
brew "autojump"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Charset analyzer and converter
brew "enca"
# Key value store for shared configuration and service discovery
brew "etcd"
# Standalone library of the Fraunhofer FDK AAC code from Android
brew "fdk-aac"
# Command-line encoder frontend for libfdk-aac
brew "fdk-aac-encoder"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Asynchronous event library
brew "libev"
# Toolkit for embedding hypervisor capabilities in your application
brew "hyperkit"
# Manage your Java environment
brew "jenv"
# Centralized server for distributed coordination of services
brew "zookeeper"
# Publish-subscribe messaging rethought as a distributed commit log
brew "kafka"
# C client library for NFS
brew "libnfs"
# NaCl networking and cryptography library
brew "libsodium"
# YAML Parser
brew "libyaml"
# Java-based project management
brew "maven"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Manage multiple Node.js versions
brew "nvm"
# Object-relational database system
brew "postgresql"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Libev port of shadowsocks
brew "shadowsocks-libev"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# General-purpose lossless data-compression library
brew "zlib"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Distributed search & analytics engine
brew "elastic/tap/elasticsearch-full"
# Analytics and search dashboard for Elasticsearch
brew "elastic/tap/kibana-full"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# A badass zsh theme with more power than a normal earthling
brew "sambadevi/powerlevel9k/powerlevel9k"
# Play, record, convert, and stream audio and video
brew "homebrew-ffmpeg/ffmpeg", args: ["with-fdk-aac"]
cask "aegisub"
cask "aerial"
cask "another-redis-desktop-manager"
cask "anydesk"
cask "baidunetdisk"
cask "betterzip"
cask "clipy"
cask "eudic"
cask "ezip"
cask "fliqlo"
cask "font-hack-nerd-font"
cask "font-sourcecodepro-nerd-font-mono"
cask "google-chrome"
cask "handbrake"
cask "iina"
cask "imageoptim"
cask "intellij-idea"
cask "iterm2"
cask "itsycal"
cask "java11"
cask "java8"
cask "jd-gui"
cask "jietu"
cask "kafka-tool"
cask "keka"
cask "makemkv"
cask "mediainfo"
cask "metaz"
cask "microsoft-remote-desktop-beta"
cask "mos"
cask "qiyimedia"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "shadowsocksx-ng"
cask "sogouinput"
cask "sourcetree"
cask "spectacle"
cask "subler"
cask "telegram-desktop-dev"
cask "trufont"
cask "tunnelblick"
cask "v2rayx"
cask 'visual-studio-code'
cask "cheatsheet"
cask "iina"
cask "vagrant"
cask "youdaodict"
# HTTP 调试工具
cask "insomnia"